NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
#include "hardware/BaseEspnow_sender.h"

#include <Preferences.h>
#include <WiFi.h>
#include <cstring>
#include <esp_now.h>
#include <esp_system.h>
#include <esp_wifi.h>
#include <freertos/queue.h>
#include <freertos/semphr.h>

#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

#include "Prog_Config.h"
#include "RtcmEspNowProtocol.h"
#include "functions/Rtcm_Frame_Reader.h"

void beginResetCohort();
void observeResetCohortStatus(const uint8_t* roverMac,
                              uint8_t fixQuality,
                              uint32_t receivedAtMs);
void markResetBranchAcked(const uint8_t* branchMac);
void progressResetCohort(uint32_t now);

namespace {
struct RoverPeer {
    uint8_t mac[6];
    bool stored;
    bool rtcmEnabled;
    uint8_t consecutiveFrameFailures;
    uint32_t cooldownUntilMs;
};

struct QueuedGnssCommand {
    uint8_t roverMac[6];
    uint32_t transactionId;
    int64_t ecefXScaled;
    int64_t ecefYScaled;
    int64_t ecefZScaled;
    uint8_t commandId;
};

struct TempRtcmRxPacket {
    uint8_t sourceMac[6];
    uint16_t length;
    uint8_t data[RTCM_ESPNOW_MAX_PACKET_SIZE];
};

struct TempRtcmReassemblyState {
    bool active;
    uint16_t streamId;
    uint32_t frameSequence;
    uint16_t frameLength;
    uint8_t fragmentCount;
    uint8_t receivedMask;
    uint32_t startedAtMs;
    uint8_t frame[RTCM_ESPNOW_MAX_FRAME_LENGTH];
};

struct ResetCohortEntry {
    uint8_t roverMac[6];
    uint8_t branchMac[6];
    uint32_t baselineReceivedAtMs;
    uint32_t nonRtkObservedAtMs;
};

struct ResetCohortBranch {
    uint8_t mac[6];
    uint32_t transactionId;
    uint32_t ackedAtMs;
    bool commandQueued;
    bool commandAcked;
};

struct DeferredTempAckState {
    bool pending;
    bool completed;
    uint8_t sourceMac[6];
    uint16_t streamId;
    uint32_t sequence;
};

BaseEspnowStats stats;
RoverPeer roverPeers[ESPNOW_MAX_PAIRED_ROVERS] = {};
BaseRoverEcefStatus latestRoverEcef[ESPNOW_MAX_ECEF_SOURCES] = {};
size_t roverPeerCount = 0;
portMUX_TYPE statsMux = portMUX_INITIALIZER_UNLOCKED;
portMUX_TYPE peerMux = portMUX_INITIALIZER_UNLOCKED;
portMUX_TYPE ecefMux = portMUX_INITIALIZER_UNLOCKED;
portMUX_TYPE pairingMux = portMUX_INITIALIZER_UNLOCKED;
portMUX_TYPE sourceMux = portMUX_INITIALIZER_UNLOCKED;
portMUX_TYPE resetMux = portMUX_INITIALIZER_UNLOCKED;
portMUX_TYPE tempAckMux = portMUX_INITIALIZER_UNLOCKED;
uint16_t streamId = 0;
uint32_t frameSequence = 0;
volatile bool lastSendSucceeded = false;
volatile bool waitingForFrameAck = false;
volatile uint16_t expectedAckStreamId = 0;
volatile uint32_t expectedAckSequence = 0;
uint8_t expectedAckMac[6] = {};
SemaphoreHandle_t sendCallbackSemaphore = nullptr;
SemaphoreHandle_t frameAckSemaphore = nullptr;
SemaphoreHandle_t espnowSendMutex = nullptr;
SemaphoreHandle_t gnssCommandResultSemaphore = nullptr;
QueueHandle_t gnssCommandQueue = nullptr;
QueueHandle_t gnssCommandResultQueue = nullptr;
QueueHandle_t tempRtcmRxQueue = nullptr;
QueueHandle_t tempRtcmFrameQueue = nullptr;
portMUX_TYPE gnssCommandMux = portMUX_INITIALIZER_UNLOCKED;
volatile bool waitingForGnssCommandResult = false;
uint8_t expectedGnssCommandMac[6] = {};
uint32_t expectedGnssCommandTransactionId = 0;
uint8_t expectedGnssCommandId = 0;
int64_t expectedGnssCommandEcefXScaled = 0;
int64_t expectedGnssCommandEcefYScaled = 0;
int64_t expectedGnssCommandEcefZScaled = 0;
uint32_t lastNoRtcmPeerWarningAtMs = 0;
size_t nextPeerStartIndex = 0;

BaseRtcmSourceSnapshot rtcmSource{};
uint32_t tempFixedReadyAtMs = 0;
uint32_t tempPreparingStartedAtMs = 0;
uint8_t tempCycleMsmMask = 0;
bool tempCycleStarted = false;
bool resetCohortRequested = false;
ResetCohortEntry resetCohort[ESPNOW_MAX_ECEF_SOURCES] = {};
ResetCohortBranch resetBranches[ESPNOW_MAX_PAIRED_ROVERS] = {};
BaseRoverEcefStatus resetCohortSnapshots[ESPNOW_MAX_ECEF_SOURCES] = {};
size_t resetCohortCount = 0;
size_t resetBranchCount = 0;
uint32_t resetGateStartedAtMs = 0;
bool resetWaitingForFreshTempLogged = false;
DeferredTempAckState deferredTempAck{};

constexpr uint8_t BROADCAST_MAC[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

bool pairingButtonReady = false;
bool pairingActive = false;
bool pendingPairResponse = false;
uint32_t pairingEndsAtMs = 0;
uint32_t pairingBaseNonce = 0;
uint32_t lastDiscoverySentAtMs = 0;
uint8_t pendingPairResponseMac[6] = {};
RtcmEspNowPairResponse pendingPairResponsePacket{};

void incrementStat(uint32_t BaseEspnowStats::*member, uint32_t amount = 1)
{
    portENTER_CRITICAL(&statsMux);
    stats.*member += amount;
    portEXIT_CRITICAL(&statsMux);
}

void setPairingActiveStat(bool active)
{
    portENTER_CRITICAL(&statsMux);
    stats.pairingActive = active;
    portEXIT_CRITICAL(&statsMux);
}

void updatePeerStats()
{
    portENTER_CRITICAL(&peerMux);
    const size_t count = roverPeerCount;
    uint32_t storedCount = 0;
    uint32_t rtcmEnabledCount = 0;
    for (size_t index = 0; index < roverPeerCount; ++index) {
        if (roverPeers[index].stored) {
            ++storedCount;
        }
        if (roverPeers[index].rtcmEnabled) {
            ++rtcmEnabledCount;
        }
    }
    portEXIT_CRITICAL(&peerMux);

    portENTER_CRITICAL(&statsMux);
    stats.activeRoverCount = static_cast<uint32_t>(count);
    stats.storedRoverCount = storedCount;
    stats.rtcmEnabledRoverCount = rtcmEnabledCount;
    portEXIT_CRITICAL(&statsMux);
}

void recordFrameSendDuration(uint32_t durationMs)
{
    portENTER_CRITICAL(&statsMux);
    stats.lastFrameSendMs = durationMs;
    if (durationMs > stats.maxFrameSendMs) {
        stats.maxFrameSendMs = durationMs;
    }
    portEXIT_CRITICAL(&statsMux);
}

bool macIsConfigured(const uint8_t* mac)
{
    return mac != nullptr &&
           (mac[0] != 0 || mac[1] != 0 || mac[2] != 0 ||
            mac[3] != 0 || mac[4] != 0 || mac[5] != 0);
}

bool macEquals(const uint8_t* a, const uint8_t* b)
{
    return a != nullptr && b != nullptr && std::memcmp(a, b, 6) == 0;
}

enum class DeferredTempAckMatch : uint8_t {
    None = 0,
    Pending,
    Completed,
};

void clearDeferredTempAck()
{
    portENTER_CRITICAL(&tempAckMux);
    deferredTempAck = {};
    portEXIT_CRITICAL(&tempAckMux);
}

DeferredTempAckMatch matchDeferredTempAck(const uint8_t* sourceMac,
                                          uint16_t streamId,
                                          uint32_t sequence)
{
    DeferredTempAckMatch match = DeferredTempAckMatch::None;
    portENTER_CRITICAL(&tempAckMux);
    if (macEquals(deferredTempAck.sourceMac, sourceMac) &&
        deferredTempAck.streamId == streamId &&
        deferredTempAck.sequence == sequence) {
        if (deferredTempAck.pending) {
            match = DeferredTempAckMatch::Pending;
        } else if (deferredTempAck.completed) {
            match = DeferredTempAckMatch::Completed;
        }
    }
    portEXIT_CRITICAL(&tempAckMux);
    return match;
}

