NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
bool stageDeferredTempAck(const uint8_t* sourceMac,
                          uint16_t streamId,
                          uint32_t sequence)
{
    bool staged = false;
    portENTER_CRITICAL(&tempAckMux);
    if (!deferredTempAck.pending) {
        deferredTempAck = {};
        deferredTempAck.pending = true;
        std::memcpy(deferredTempAck.sourceMac, sourceMac,
                    sizeof(deferredTempAck.sourceMac));
        deferredTempAck.streamId = streamId;
        deferredTempAck.sequence = sequence;
        staged = true;
    }
    portEXIT_CRITICAL(&tempAckMux);
    return staged;
}

void cancelDeferredTempAck(const uint8_t* sourceMac,
                           uint16_t streamId,
                           uint32_t sequence)
{
    portENTER_CRITICAL(&tempAckMux);
    if (deferredTempAck.pending &&
        macEquals(deferredTempAck.sourceMac, sourceMac) &&
        deferredTempAck.streamId == streamId &&
        deferredTempAck.sequence == sequence) {
        deferredTempAck = {};
    }
    portEXIT_CRITICAL(&tempAckMux);
}

String macToString(const uint8_t* mac)
{
    if (mac == nullptr) {
        return String("<null>");
    }
    char buffer[18];
    snprintf(buffer, sizeof(buffer), "%02X:%02X:%02X:%02X:%02X:%02X",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return String(buffer);
}

uint16_t newStreamId()
{
    uint16_t value = 0;
    while (value == 0) {
        value = static_cast<uint16_t>(esp_random() & 0xFFFFU);
    }
    return value;
}

uint16_t rtcmMessageId(const uint8_t* frame, size_t length)
{
    if (frame == nullptr || length < 5) {
        return 0;
    }
    return static_cast<uint16_t>((static_cast<uint16_t>(frame[3]) << 4) |
                                 (static_cast<uint16_t>(frame[4]) >> 4));
}

bool validateCompleteRtcmFrame(const uint8_t* frame, size_t length)
{
    if (frame == nullptr || length < 6 || length > RTCM_ESPNOW_MAX_FRAME_LENGTH ||
        frame[0] != 0xD3 || (frame[1] & 0xFCU) != 0) {
        return false;
    }
    const size_t payloadLength =
        (static_cast<size_t>(frame[1] & 0x03U) << 8) | frame[2];
    if (length != payloadLength + 6) {
        return false;
    }
    const uint32_t expected =
        (static_cast<uint32_t>(frame[length - 3]) << 16) |
        (static_cast<uint32_t>(frame[length - 2]) << 8) |
        static_cast<uint32_t>(frame[length - 1]);
    return rtcmCrc24q(frame, length - 3) == expected;
}

void rotateDownstreamStreamLocked()
{
    streamId = newStreamId();
    frameSequence = 0;
}

void beginTempPreparing(const uint8_t* mac)
{
    const uint32_t now = millis();
    portENTER_CRITICAL(&sourceMux);
    rtcmSource.state = BaseRtcmSourceState::TempPreparing;
    std::memcpy(rtcmSource.tempBaseMac, mac, sizeof(rtcmSource.tempBaseMac));
    rtcmSource.lastTempFrameAtMs = 0;
    rtcmSource.readyCycles = 0;
    tempPreparingStartedAtMs = now;
    tempFixedReadyAtMs = now + TEMP_RTCM_FIXED_GUARD_MS;
    tempCycleMsmMask = 0;
    tempCycleStarted = false;
    resetCohortRequested = false;
    portEXIT_CRITICAL(&sourceMux);
    clearDeferredTempAck();
    if (tempRtcmFrameQueue != nullptr) {
        xQueueReset(tempRtcmFrameQueue);
    }
    if (tempRtcmRxQueue != nullptr) {
        xQueueReset(tempRtcmRxQueue);
    }
    Serial.printf("[BASE][RTCM_SOURCE] state=TEMP_PREPARING temp=%s mode=fixed_ecef\n",
                  macToString(mac).c_str());
}

void switchToLocalFallback(const char* reason)
{
    bool fallback = false;
    bool preparationCanceled = false;
    uint32_t epoch = 0;
    uint16_t activeStreamId = 0;
    portENTER_CRITICAL(&sourceMux);
    fallback = rtcmSource.state == BaseRtcmSourceState::TempActive;
    preparationCanceled =
        rtcmSource.state == BaseRtcmSourceState::TempPreparing ||
        rtcmSource.state == BaseRtcmSourceState::TempResetting;
    if (fallback) {
        rtcmSource.state = BaseRtcmSourceState::LocalFallback;
        ++rtcmSource.epoch;
        rtcmSource.lastTempFrameAtMs = 0;
        rtcmSource.readyCycles = 0;
        tempPreparingStartedAtMs = 0;
        resetCohortRequested = false;
        rotateDownstreamStreamLocked();
    } else if (preparationCanceled) {
        rtcmSource.state = BaseRtcmSourceState::LocalActive;
        std::memset(rtcmSource.tempBaseMac, 0, sizeof(rtcmSource.tempBaseMac));
        rtcmSource.lastTempFrameAtMs = 0;
        rtcmSource.readyCycles = 0;
        tempPreparingStartedAtMs = 0;
        resetCohortRequested = false;
    }
    epoch = rtcmSource.epoch;
    activeStreamId = streamId;
    portEXIT_CRITICAL(&sourceMux);
    if (!fallback && !preparationCanceled) {
        return;
    }
    clearDeferredTempAck();
    if (tempRtcmFrameQueue != nullptr) {
        xQueueReset(tempRtcmFrameQueue);
    }
    if (tempRtcmRxQueue != nullptr) {
        xQueueReset(tempRtcmRxQueue);
    }
    if (fallback) {
        incrementStat(&BaseEspnowStats::sourceFallbacks);
        Serial.printf("[BASE][RTCM_SOURCE] state=LOCAL_FALLBACK epoch=%lu streamId=%u reason=%s\n",
                      static_cast<unsigned long>(epoch),
                      activeStreamId,
                      reason == nullptr ? "unknown" : reason);
    } else {
        Serial.printf("[BASE][RTCM_SOURCE] state=LOCAL_ACTIVE preparation_canceled reason=%s\n",
                      reason == nullptr ? "unknown" : reason);
    }
}

void activateTempSource()
{
    uint8_t mac[6] = {};
    uint32_t epoch = 0;
    uint16_t newId = 0;
    portENTER_CRITICAL(&sourceMux);
    if (rtcmSource.state != BaseRtcmSourceState::TempResetting) {
        portEXIT_CRITICAL(&sourceMux);
        return;
    }
    rtcmSource.state = BaseRtcmSourceState::TempActive;
    ++rtcmSource.epoch;
    tempPreparingStartedAtMs = 0;
    resetCohortRequested = false;
    rotateDownstreamStreamLocked();
    std::memcpy(mac, rtcmSource.tempBaseMac, sizeof(mac));
    epoch = rtcmSource.epoch;
    newId = streamId;
    portEXIT_CRITICAL(&sourceMux);
    clearDeferredTempAck();
    incrementStat(&BaseEspnowStats::sourceSwitches);
    Serial.printf("[BASE][RTCM_SOURCE] state=TEMP_ACTIVE temp=%s epoch=%lu streamId=%u\n",
                  macToString(mac).c_str(),
                  static_cast<unsigned long>(epoch),
                  newId);
}

uint8_t msmBitForMessage(uint16_t messageId)
{
    switch (messageId) {
    case 1074: return 0x01;
    case 1084: return 0x02;
    case 1094: return 0x04;
    case 1124: return 0x08;
    default: return 0;
    }
}

void updateTempReadiness(uint16_t messageId, uint32_t now)
{
    portENTER_CRITICAL(&sourceMux);
    if (rtcmSource.state == BaseRtcmSourceState::TempPreparing &&
        static_cast<int32_t>(now - tempFixedReadyAtMs) >= 0) {
        if (messageId == 1006) {
            if (tempCycleStarted && tempCycleMsmMask == 0x0F) {
                if (rtcmSource.readyCycles < UINT8_MAX) {
                    ++rtcmSource.readyCycles;
                }
            } else if (tempCycleStarted) {
                rtcmSource.readyCycles = 0;
            }
            tempCycleStarted = true;
            tempCycleMsmMask = 0;
        } else if (tempCycleStarted) {
            tempCycleMsmMask |= msmBitForMessage(messageId);
        }
        if (rtcmSource.readyCycles >= TEMP_RTCM_READY_CYCLES) {
            resetCohortRequested = true;
        }
    }
    portEXIT_CRITICAL(&sourceMux);
}

void makeRoverMacKey(size_t index, char* buffer, size_t bufferSize)
{
    snprintf(buffer, bufferSize, "%s%u",
             ESPNOW_NVS_ROVER_MAC_PREFIX,
             static_cast<unsigned>(index));
}

