NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
uint32_t localDeviceId()
{
    uint8_t mac[6] = {};
    if (esp_wifi_get_mac(WIFI_IF_STA, mac) != ESP_OK) {
        return 0;
    }
    return (static_cast<uint32_t>(mac[2]) << 24) |
           (static_cast<uint32_t>(mac[3]) << 16) |
           (static_cast<uint32_t>(mac[4]) << 8) |
           static_cast<uint32_t>(mac[5]);
}

bool addEspNowPeer(const uint8_t* mac, bool encrypted)
{
    if (!macIsConfigured(mac)) {
        return false;
    }

    esp_now_peer_info_t peerInfo = {};
    std::memcpy(peerInfo.peer_addr, mac, sizeof(peerInfo.peer_addr));
    peerInfo.channel = ESPNOW_WIFI_CHANNEL;
    peerInfo.ifidx = WIFI_IF_STA;
    peerInfo.encrypt = encrypted;
    if (peerInfo.encrypt) {
        std::memcpy(peerInfo.lmk, ESPNOW_LMK, sizeof(peerInfo.lmk));
    }

    const esp_err_t result = esp_now_is_peer_exist(mac)
                                 ? esp_now_mod_peer(&peerInfo)
                                 : esp_now_add_peer(&peerInfo);
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] esp_now_add/mod_peer %s failed: %d\n",
                      macToString(mac).c_str(),
                      result);
        return false;
    }
    return true;
}

bool addRoverRuntimePeer(const uint8_t* mac, bool stored)
{
    if (!macIsConfigured(mac)) {
        return false;
    }

    portENTER_CRITICAL(&peerMux);
    for (size_t index = 0; index < roverPeerCount; ++index) {
        if (macEquals(roverPeers[index].mac, mac)) {
            roverPeers[index].stored = roverPeers[index].stored || stored;
            roverPeers[index].rtcmEnabled = true;
            roverPeers[index].consecutiveFrameFailures = 0;
            roverPeers[index].cooldownUntilMs = 0;
            portEXIT_CRITICAL(&peerMux);
            updatePeerStats();
            return true;
        }
    }

    if (roverPeerCount >= ESPNOW_MAX_PAIRED_ROVERS) {
        portEXIT_CRITICAL(&peerMux);
        Serial.printf("[BASE][PAIR][WARN] Rover list full, ignore %s\n",
                      macToString(mac).c_str());
        return false;
    }

    std::memcpy(roverPeers[roverPeerCount].mac, mac, 6);
    roverPeers[roverPeerCount].stored = stored;
    roverPeers[roverPeerCount].rtcmEnabled = true;
    roverPeers[roverPeerCount].consecutiveFrameFailures = 0;
    roverPeers[roverPeerCount].cooldownUntilMs = 0;
    ++roverPeerCount;
    portEXIT_CRITICAL(&peerMux);

    updatePeerStats();
    return addEspNowPeer(mac, ESPNOW_ENCRYPTION_ENABLED);
}

bool findRoverPeerIndex(const uint8_t* mac, size_t& selectedIndex)
{
    bool found = false;
    portENTER_CRITICAL(&peerMux);
    for (size_t index = 0; index < roverPeerCount; ++index) {
        if (macEquals(roverPeers[index].mac, mac)) {
            selectedIndex = index;
            found = true;
            break;
        }
    }
    portEXIT_CRITICAL(&peerMux);
    return found;
}

bool storeLatestRoverEcef(const uint8_t* roverMac,
                          const uint8_t* relayMac,
                          bool viaRelay,
                          uint32_t sequence,
                          uint32_t gnssTimeMsOfDay,
                          uint16_t correctionStreamId,
                          int64_t ecefXScaled,
                          int64_t ecefYScaled,
                          int64_t ecefZScaled,
                          uint8_t fixQuality)
{
    const uint32_t receivedAtMs = millis();
    const BaseRtcmSourceSnapshot source = getBaseRtcmSourceSnapshot();
    size_t selectedIndex = ESPNOW_MAX_ECEF_SOURCES;
    size_t freeIndex = ESPNOW_MAX_ECEF_SOURCES;
    portENTER_CRITICAL(&ecefMux);
    for (size_t index = 0; index < ESPNOW_MAX_ECEF_SOURCES; ++index) {
        if (latestRoverEcef[index].valid &&
            macEquals(latestRoverEcef[index].mac, roverMac)) {
            selectedIndex = index;
            break;
        }
        if (!latestRoverEcef[index].valid &&
            freeIndex == ESPNOW_MAX_ECEF_SOURCES) {
            freeIndex = index;
        }
    }
    if (selectedIndex == ESPNOW_MAX_ECEF_SOURCES) {
        selectedIndex = freeIndex;
    }
    if (selectedIndex == ESPNOW_MAX_ECEF_SOURCES) {
        portEXIT_CRITICAL(&ecefMux);
        return false;
    }

    BaseRoverEcefStatus& latest = latestRoverEcef[selectedIndex];
    std::memcpy(latest.mac, roverMac, sizeof(latest.mac));
    if (viaRelay && relayMac != nullptr) {
        std::memcpy(latest.relayMac, relayMac, sizeof(latest.relayMac));
    } else {
        std::memset(latest.relayMac, 0, sizeof(latest.relayMac));
    }
    latest.viaRelay = viaRelay;
    latest.sequence = sequence;
    latest.gnssTimeMsOfDay = gnssTimeMsOfDay;
    latest.correctionStreamId = correctionStreamId;
    latest.ecefXScaled = ecefXScaled;
    latest.ecefYScaled = ecefYScaled;
    latest.ecefZScaled = ecefZScaled;
    latest.fixQuality = fixQuality;
    latest.rtcmSourceState = source.state;
    latest.usesTempBase = source.state == BaseRtcmSourceState::TempActive;
    latest.hasSelectedTempBase =
        (source.state == BaseRtcmSourceState::TempPreparing ||
         source.state == BaseRtcmSourceState::TempResetting ||
         source.state == BaseRtcmSourceState::TempActive ||
         source.state == BaseRtcmSourceState::LocalFallback) &&
        macIsConfigured(source.tempBaseMac);
    if (latest.hasSelectedTempBase) {
        std::memcpy(latest.tempBaseMac,
                    source.tempBaseMac,
                    sizeof(latest.tempBaseMac));
    } else {
        std::memset(latest.tempBaseMac, 0, sizeof(latest.tempBaseMac));
    }
    latest.rtcmSourceEpoch = source.epoch;
    latest.receivedAtMs = receivedAtMs;
    latest.valid = true;
    portEXIT_CRITICAL(&ecefMux);
    observeResetCohortStatus(roverMac, fixQuality, receivedAtMs);
    return true;
}

size_t copyRoverPeers(RoverPeer* destination, size_t capacity)
{
    portENTER_CRITICAL(&peerMux);
    const size_t count = roverPeerCount < capacity ? roverPeerCount : capacity;
    for (size_t index = 0; index < count; ++index) {
        destination[index] = roverPeers[index];
    }
    portEXIT_CRITICAL(&peerMux);
    return count;
}

bool saveRoverToNvs(const uint8_t* mac)
{
    if (!macIsConfigured(mac)) {
        return false;
    }

    Preferences preferences;
    if (!preferences.begin(ESPNOW_NVS_NAMESPACE, false)) {
        Serial.println("[BASE][PAIR][ERROR] Khong mo duoc NVS de luu Rover MAC");
        return false;
    }

