NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
        if (currentSourceState == BaseRtcmSourceState::TempActive) {
            const DeferredTempAckMatch ackMatch =
                matchDeferredTempAck(packet.sourceMac,
                                     header.streamId,
                                     header.frameSequence);
            if (ackMatch != DeferredTempAckMatch::None) {
                portENTER_CRITICAL(&sourceMux);
                rtcmSource.lastTempFrameAtMs = millis();
                portEXIT_CRITICAL(&sourceMux);
                incrementStat(&BaseEspnowStats::tempDeferredDuplicates);
                if (ackMatch == DeferredTempAckMatch::Completed) {
                    sendTempRtcmAck(packet.sourceMac,
                                    header.streamId,
                                    header.frameSequence);
                }
                continue;
            }
        } else if (haveCompleted &&
                   header.streamId == completedStreamId &&
                   header.frameSequence == completedSequence) {
            sendTempRtcmAck(packet.sourceMac, header.streamId, header.frameSequence);
            continue;
        }

        const bool sameFrame = reassembly.active &&
                               reassembly.streamId == header.streamId &&
                               reassembly.frameSequence == header.frameSequence;
        if (!sameFrame) {
            reassembly = {};
            reassembly.active = true;
            reassembly.streamId = header.streamId;
            reassembly.frameSequence = header.frameSequence;
            reassembly.frameLength = header.frameLength;
            reassembly.fragmentCount = header.fragmentCount;
            reassembly.startedAtMs = millis();
        } else if (reassembly.frameLength != header.frameLength ||
                   reassembly.fragmentCount != header.fragmentCount) {
            reassembly = {};
            incrementStat(&BaseEspnowStats::tempFramesInvalid);
            continue;
        }

        const uint8_t fragmentBit = static_cast<uint8_t>(1U << header.fragmentIndex);
        if ((reassembly.receivedMask & fragmentBit) == 0) {
            const size_t offset = static_cast<size_t>(header.fragmentIndex) *
                                  RTCM_ESPNOW_MAX_FRAGMENT_PAYLOAD;
            std::memcpy(reassembly.frame + offset,
                        packet.data + sizeof(RtcmEspNowHeader),
                        header.payloadLength);
            reassembly.receivedMask |= fragmentBit;
        }

        const uint8_t expectedMask = static_cast<uint8_t>(
            (1U << reassembly.fragmentCount) - 1U);
        if (reassembly.receivedMask != expectedMask) {
            continue;
        }

        if (!validateCompleteRtcmFrame(reassembly.frame, reassembly.frameLength)) {
            reassembly = {};
            incrementStat(&BaseEspnowStats::tempFramesInvalid);
            continue;
        }

        const uint32_t now = millis();
        const uint16_t messageId = rtcmMessageId(reassembly.frame, reassembly.frameLength);
        portENTER_CRITICAL(&sourceMux);
        rtcmSource.lastTempFrameAtMs = now;
        portEXIT_CRITICAL(&sourceMux);
        updateTempReadiness(messageId, now);

        BaseRtcmSourceSnapshot sourceSnapshot{};
        portENTER_CRITICAL(&sourceMux);
        sourceSnapshot = rtcmSource;
        portEXIT_CRITICAL(&sourceMux);

        bool accepted =
            sourceSnapshot.state == BaseRtcmSourceState::TempPreparing ||
            sourceSnapshot.state == BaseRtcmSourceState::TempResetting;
        if (sourceSnapshot.state == BaseRtcmSourceState::TempActive) {
            const bool staged =
                stageDeferredTempAck(packet.sourceMac,
                                     reassembly.streamId,
                                     reassembly.frameSequence);
            if (staged) {
                BaseTempRtcmFrame output{};
                output.length = reassembly.frameLength;
                output.messageId = messageId;
                output.receivedAtMs = now;
                std::memcpy(output.sourceMac, packet.sourceMac,
                            sizeof(output.sourceMac));
                output.upstreamStreamId = reassembly.streamId;
                output.upstreamSequence = reassembly.frameSequence;
                std::memcpy(output.data, reassembly.frame, output.length);
                accepted = tempRtcmFrameQueue != nullptr &&
                           xQueueSend(tempRtcmFrameQueue, &output, 0) == pdTRUE;
            } else {
                accepted = false;
                incrementStat(&BaseEspnowStats::tempFramesInvalid);
            }
            if (!accepted && staged) {
                cancelDeferredTempAck(packet.sourceMac,
                                      reassembly.streamId,
                                      reassembly.frameSequence);
                incrementStat(&BaseEspnowStats::tempQueueDrops);
            }
        }

        if (accepted) {
            incrementStat(&BaseEspnowStats::tempFramesValid);
            if (sourceSnapshot.state == BaseRtcmSourceState::TempActive) {
                incrementStat(&BaseEspnowStats::tempAcksDeferred);
            } else {
                haveCompleted = true;
                completedStreamId = reassembly.streamId;
                completedSequence = reassembly.frameSequence;
                sendTempRtcmAck(packet.sourceMac,
                                reassembly.streamId,
                                reassembly.frameSequence);
            }
        }
        reassembly = {};
    }
}

const char* gnssCommandName(uint8_t commandId)
{
    switch (commandId) {
    case RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_FIXED_ECEF:
        return "switch_to_base_fixed_ecef";
    case RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER:
        return "switch_to_rover";
    case RTCM_ESPNOW_GNSS_COMMAND_RESET_RTK:
        return "rtk_reset";
    case RTCM_ESPNOW_GNSS_COMMAND_RESUME_RTK:
        return "rtk_resume";
    default:
        return "unknown";
    }
}

void setRoverRtcmEnabled(const uint8_t* mac, bool enabled)
{
    bool changed = false;
    portENTER_CRITICAL(&peerMux);
    for (size_t index = 0; index < roverPeerCount; ++index) {
        if (macEquals(roverPeers[index].mac, mac)) {
            changed = roverPeers[index].rtcmEnabled != enabled;
            roverPeers[index].rtcmEnabled = enabled;
            if (enabled) {
                roverPeers[index].consecutiveFrameFailures = 0;
                roverPeers[index].cooldownUntilMs = 0;
            }
            break;
        }
    }
    portEXIT_CRITICAL(&peerMux);
    if (changed) {
        updatePeerStats();
    }
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onDataSent(const wifi_tx_info_t*, esp_now_send_status_t status)
#else
void onDataSent(const uint8_t*, esp_now_send_status_t status)
#endif
{
    lastSendSucceeded = (status == ESP_NOW_SEND_SUCCESS);
    if (sendCallbackSemaphore != nullptr) {
        xSemaphoreGive(sendCallbackSemaphore);
    }
}

void queuePairResponse(const uint8_t* sourceMac, const uint8_t* data, int length)
{
    if (!ESPNOW_PAIRING_ENABLED || sourceMac == nullptr || data == nullptr ||
        length != static_cast<int>(sizeof(RtcmEspNowPairResponse))) {
        return;
    }

    bool active = false;
    portENTER_CRITICAL(&pairingMux);
    active = pairingActive;
    if (active) {
        std::memcpy(&pendingPairResponsePacket, data, sizeof(pendingPairResponsePacket));
        std::memcpy(pendingPairResponseMac, sourceMac, sizeof(pendingPairResponseMac));
        pendingPairResponse = true;
    }
    portEXIT_CRITICAL(&pairingMux);
}

bool peerCooldownActive(const RoverPeer& peer, uint32_t now)
{
    return peer.cooldownUntilMs != 0 &&
           static_cast<int32_t>(now - peer.cooldownUntilMs) < 0;
}

void recordPeerDeliveryResult(const uint8_t* mac, bool delivered)
{
    bool enteredCooldown = false;
    bool recovered = false;
    uint8_t failureCount = 0;
    uint32_t cooldownMs = 0;
    const uint32_t now = millis();

