NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
    sendControlPacket(BROADCAST_MAC,
                      reinterpret_cast<const uint8_t*>(&discovery),
                      sizeof(discovery));
}

void processPendingPairResponse()
{
    RtcmEspNowPairResponse response{};
    uint8_t sourceMac[6] = {};
    uint32_t expectedNonce = 0;
    bool hasPending = false;

    portENTER_CRITICAL(&pairingMux);
    hasPending = pendingPairResponse;
    expectedNonce = pairingBaseNonce;
    if (hasPending) {
        response = pendingPairResponsePacket;
        std::memcpy(sourceMac, pendingPairResponseMac, sizeof(sourceMac));
        pendingPairResponse = false;
    }
    portEXIT_CRITICAL(&pairingMux);

    if (!hasPending) {
        return;
    }

    if (!rtcmEspNowValidatePairResponse(response,
                                        sizeof(response),
                                        ESPNOW_NETWORK_ID,
                                        expectedNonce,
                                        ESPNOW_PAIRING_KEY,
                                        sizeof(ESPNOW_PAIRING_KEY))) {
        incrementStat(&BaseEspnowStats::pairAuthFailures);
        Serial.println("[BASE][PAIR][WARN] Invalid PAIR_RESPONSE from " + macToString(sourceMac));
        return;
    }

    if (!addEspNowPeer(sourceMac, false)) {
        return;
    }

    RtcmEspNowPairConfirm confirm{};
    confirm.common.magic = RTCM_ESPNOW_MAGIC;
    confirm.common.version = RTCM_ESPNOW_VERSION;
    confirm.common.packetType = RTCM_ESPNOW_PACKET_TYPE_PAIR_CONFIRM;
    confirm.role = RTCM_ESPNOW_ROLE_BASE;
    confirm.networkId = ESPNOW_NETWORK_ID;
    confirm.baseNonce = response.baseNonceEcho;
    confirm.roverNonce = response.roverNonce;
    confirm.authTag = rtcmEspNowPairingAuthTag(confirm,
                                               ESPNOW_PAIRING_KEY,
                                               sizeof(ESPNOW_PAIRING_KEY));

    if (!sendControlPacket(sourceMac,
                           reinterpret_cast<const uint8_t*>(&confirm),
                           sizeof(confirm))) {
        Serial.println("[BASE][PAIR][ERROR] Gui PAIR_CONFIRM that bai");
        return;
    }

    incrementStat(&BaseEspnowStats::pairResponsesReceived);
    incrementStat(&BaseEspnowStats::pairConfirmsSent);
    if (!saveRoverToNvs(sourceMac)) {
        Serial.println("[BASE][PAIR][ERROR] Luu Rover MAC vao NVS that bai");
        return;
    }

    Serial.println("[BASE][PAIR] Paired Rover " + macToString(sourceMac));
    stopPairingMode("paired");
}

void queueLocalGnssCommandTimeout(const QueuedGnssCommand& command)
{
    BaseGnssCommandResultEvent event{};
    std::memcpy(event.roverMac, command.roverMac, sizeof(event.roverMac));
    event.transactionId = command.transactionId;
    event.commandId = command.commandId;
    event.ecefXScaled = command.ecefXScaled;
    event.ecefYScaled = command.ecefYScaled;
    event.ecefZScaled = command.ecefZScaled;
    event.receivedAtMs = millis();
    event.responseTimedOut = true;
    if (gnssCommandResultQueue != nullptr &&
        xQueueSend(gnssCommandResultQueue, &event, 0) != pdTRUE) {
        BaseGnssCommandResultEvent discarded{};
        xQueueReceive(gnssCommandResultQueue, &discarded, 0);
        xQueueSend(gnssCommandResultQueue, &event, 0);
    }
}

void processNextGnssCommand()
{
    if (gnssCommandQueue == nullptr || gnssCommandResultSemaphore == nullptr) {
        return;
    }

    QueuedGnssCommand command{};
    if (xQueueReceive(gnssCommandQueue, &command, 0) != pdTRUE) {
        return;
    }

    while (xSemaphoreTake(gnssCommandResultSemaphore, 0) == pdTRUE) {
    }
    portENTER_CRITICAL(&gnssCommandMux);
    std::memcpy(expectedGnssCommandMac, command.roverMac,
                sizeof(expectedGnssCommandMac));
    expectedGnssCommandTransactionId = command.transactionId;
    expectedGnssCommandId = command.commandId;
    expectedGnssCommandEcefXScaled = command.ecefXScaled;
    expectedGnssCommandEcefYScaled = command.ecefYScaled;
    expectedGnssCommandEcefZScaled = command.ecefZScaled;
    waitingForGnssCommandResult = true;
    portEXIT_CRITICAL(&gnssCommandMux);

    GnssCommandRequestPacket packet{};
    packet.common.magic = RTCM_ESPNOW_MAGIC;
    packet.common.version = RTCM_ESPNOW_VERSION;
    packet.common.packetType = RTCM_ESPNOW_PACKET_TYPE_GNSS_COMMAND_REQUEST;
    packet.networkId = ESPNOW_NETWORK_ID;
    packet.transactionId = command.transactionId;
    packet.ecefXScaled = command.ecefXScaled;
    packet.ecefYScaled = command.ecefYScaled;
    packet.ecefZScaled = command.ecefZScaled;
    packet.commandId = command.commandId;
    packet.targetPort = RTCM_ESPNOW_GNSS_PORT_COM2;
    packet.authTag = rtcmEspNowPairingAuthTag(packet,
                                              ESPNOW_PAIRING_KEY,
                                              sizeof(ESPNOW_PAIRING_KEY));

    if (command.commandId == RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_FIXED_ECEF) {
        beginTempPreparing(command.roverMac);
    }

    bool resultReceived = false;
    for (uint8_t attempt = 0;
         attempt <= ESPNOW_GNSS_COMMAND_SEND_RETRY_COUNT && !resultReceived;
         ++attempt) {
        if (!sendControlPacket(command.roverMac,
                               reinterpret_cast<const uint8_t*>(&packet),
                               sizeof(packet))) {
            Serial.printf("[BASE][GNSS_CMD][WARN] Radio send failed txn=%lu attempt=%u\n",
                          static_cast<unsigned long>(command.transactionId),
                          attempt + 1);
            delay(20);
            continue;
        }
        incrementStat(&BaseEspnowStats::gnssCommandSent);
        Serial.printf("[BASE][GNSS_CMD] Sent action=%s txn=%lu rover=%s "
                      "ecef_m=(%.4f,%.4f,%.4f) attempt=%u\n",
                      gnssCommandName(command.commandId),
                      static_cast<unsigned long>(command.transactionId),
                      macToString(command.roverMac).c_str(),
                      static_cast<double>(command.ecefXScaled) /
                          RTCM_ESPNOW_ECEF_SCALE,
                      static_cast<double>(command.ecefYScaled) /
                          RTCM_ESPNOW_ECEF_SCALE,
                      static_cast<double>(command.ecefZScaled) /
                          RTCM_ESPNOW_ECEF_SCALE,
                      attempt + 1);
        resultReceived =
            xSemaphoreTake(gnssCommandResultSemaphore,
                           pdMS_TO_TICKS(ESPNOW_GNSS_COMMAND_RESULT_TIMEOUT_MS)) == pdTRUE;
    }

    portENTER_CRITICAL(&gnssCommandMux);
    waitingForGnssCommandResult = false;
    portEXIT_CRITICAL(&gnssCommandMux);
    if (!resultReceived) {
        incrementStat(&BaseEspnowStats::gnssCommandTimeouts);
        if (command.commandId == RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_FIXED_ECEF) {
            switchToLocalFallback("temp_base_command_timeout");
        }
        queueLocalGnssCommandTimeout(command);
        Serial.printf("[BASE][GNSS_CMD][ERROR] Result timeout txn=%lu rover=%s\n",
                      static_cast<unsigned long>(command.transactionId),
                      macToString(command.roverMac).c_str());
    }
}
}

bool setupEspNowBase()
{
    sendCallbackSemaphore = xSemaphoreCreateBinary();
    frameAckSemaphore = xSemaphoreCreateBinary();
    espnowSendMutex = xSemaphoreCreateMutex();
    gnssCommandResultSemaphore = xSemaphoreCreateBinary();
    gnssCommandQueue = xQueueCreate(ESPNOW_GNSS_COMMAND_QUEUE_LENGTH,
                                    sizeof(QueuedGnssCommand));
    gnssCommandResultQueue = xQueueCreate(ESPNOW_GNSS_COMMAND_RESULT_QUEUE_LENGTH,
                                          sizeof(BaseGnssCommandResultEvent));
    tempRtcmRxQueue = xQueueCreate(TEMP_RTCM_RX_QUEUE_LENGTH,
                                   sizeof(TempRtcmRxPacket));
    tempRtcmFrameQueue = xQueueCreate(TEMP_RTCM_FRAME_QUEUE_LENGTH,
                                      sizeof(BaseTempRtcmFrame));
    if (sendCallbackSemaphore == nullptr || frameAckSemaphore == nullptr ||
        espnowSendMutex == nullptr || gnssCommandResultSemaphore == nullptr ||
        gnssCommandQueue == nullptr || gnssCommandResultQueue == nullptr ||
        tempRtcmRxQueue == nullptr || tempRtcmFrameQueue == nullptr) {
        Serial.println("[BASE][ESP-NOW][ERROR] Failed to create semaphores");
        return false;
    }

    setupPairingButton();

    WiFi.mode(WIFI_STA);
    WiFi.disconnect(false, true);
    delay(50);
    if (!configureMaxTxPower()) {
        return false;
    }

    esp_wifi_set_ps(WIFI_PS_NONE);

    uint8_t protocol = WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N;
#ifdef WIFI_PROTOCOL_LR
    if (ESPNOW_USE_LR_250KBPS) {
        protocol |= WIFI_PROTOCOL_LR;
    }
#endif
    esp_wifi_set_protocol(WIFI_IF_STA, protocol);

