NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
    uint16_t currentStreamId = 0;
    uint32_t currentSequence = 0;
    portENTER_CRITICAL(&sourceMux);
    currentStreamId = streamId;
    currentSequence = frameSequence++;
    portEXIT_CRITICAL(&sourceMux);
    const uint32_t sendStartedAt = millis();
    bool allPeersAcked = true;
    size_t attemptedPeers = 0;
    const size_t startIndex = nextPeerStartIndex % peerCount;
    nextPeerStartIndex = (startIndex + 1) % peerCount;
    const BaseRtcmSourceSnapshot sourceSnapshot =
        getBaseRtcmSourceSnapshot();
    const bool hasSelectedTemp =
        sourceSnapshot.state == BaseRtcmSourceState::TempPreparing ||
        sourceSnapshot.state == BaseRtcmSourceState::TempResetting ||
        sourceSnapshot.state == BaseRtcmSourceState::TempActive;

    for (size_t offset = 0; offset < peerCount; ++offset) {
        const size_t index = (startIndex + offset) % peerCount;
        if (hasSelectedTemp &&
            macEquals(peers[index].mac, sourceSnapshot.tempBaseMac)) {
            continue;
        }
        if (!peers[index].rtcmEnabled) {
            continue;
        }
        if (peerCooldownActive(peers[index], millis())) {
            incrementStat(&BaseEspnowStats::peerCooldownSkips);
            continue;
        }
        ++attemptedPeers;
        const bool delivered = sendFrameToPeer(peers[index].mac,
                                               frame,
                                               length,
                                               currentStreamId,
                                               currentSequence);
        recordPeerDeliveryResult(peers[index].mac, delivered);
        if (!delivered) {
            allPeersAcked = false;
            Serial.printf("[BASE][ESP-NOW][ERROR] Drop seq=%lu for peer=%s without application ACK\n",
                          static_cast<unsigned long>(currentSequence),
                          macToString(peers[index].mac).c_str());
        }
    }

    waitingForFrameAck = false;
    if (attemptedPeers == 0) {
        incrementStat(&BaseEspnowStats::framesDropped);
        const uint32_t now = millis();
        if (lastNoRtcmPeerWarningAtMs == 0 ||
            now - lastNoRtcmPeerWarningAtMs >= HEALTH_INTERVAL) {
            lastNoRtcmPeerWarningAtMs = now;
            Serial.println("[BASE][ESP-NOW][WARN] Drop RTCM frame: all RTCM peers disabled or in cooldown");
        }
        return false;
    }
    recordFrameSendDuration(millis() - sendStartedAt);

    if (allPeersAcked) {
        incrementStat(&BaseEspnowStats::framesSent);
        return true;
    }

    incrementStat(&BaseEspnowStats::framesDropped);
    return false;
}

BaseEspnowStats getBaseEspnowStats()
{
    updatePeerStats();
    portENTER_CRITICAL(&statsMux);
    const BaseEspnowStats copy = stats;
    portEXIT_CRITICAL(&statsMux);
    return copy;
}

uint16_t getBaseEspNowStreamId()
{
    portENTER_CRITICAL(&sourceMux);
    const uint16_t copy = streamId;
    portEXIT_CRITICAL(&sourceMux);
    return copy;
}

bool baseEspNowShouldForwardLocalRtcm()
{
    portENTER_CRITICAL(&sourceMux);
    const bool forward =
        rtcmSource.state != BaseRtcmSourceState::TempResetting &&
        rtcmSource.state != BaseRtcmSourceState::TempActive;
    portEXIT_CRITICAL(&sourceMux);
    return forward;
}

bool baseEspNowPopTempRtcmFrame(BaseTempRtcmFrame& frame, TickType_t waitTicks)
{
    return tempRtcmFrameQueue != nullptr &&
           xQueueReceive(tempRtcmFrameQueue, &frame, waitTicks) == pdTRUE;
}

void baseEspNowCompleteTempRtcmForward(const BaseTempRtcmFrame& frame,
                                       bool downstreamDelivered)
{
    bool shouldAck = false;
    portENTER_CRITICAL(&tempAckMux);
    if (deferredTempAck.pending &&
        macEquals(deferredTempAck.sourceMac, frame.sourceMac) &&
        deferredTempAck.streamId == frame.upstreamStreamId &&
        deferredTempAck.sequence == frame.upstreamSequence) {
        deferredTempAck.pending = false;
        deferredTempAck.completed = true;
        shouldAck = true;
    }
    portEXIT_CRITICAL(&tempAckMux);
    if (!shouldAck) {
        return;
    }

    incrementStat(&BaseEspnowStats::tempForwardCompleted);
    if (!downstreamDelivered) {
        incrementStat(&BaseEspnowStats::tempForwardFailed);
    }
    sendTempRtcmAck(frame.sourceMac,
                    frame.upstreamStreamId,
                    frame.upstreamSequence);
}

BaseRtcmSourceSnapshot getBaseRtcmSourceSnapshot()
{
    portENTER_CRITICAL(&sourceMux);
    const BaseRtcmSourceSnapshot copy = rtcmSource;
    portEXIT_CRITICAL(&sourceMux);
    return copy;
}

bool baseEspNowGnssCommandPending()
{
    return waitingForGnssCommandResult ||
           (gnssCommandQueue != nullptr &&
            uxQueueMessagesWaiting(gnssCommandQueue) != 0);
}

const char* baseRtcmSourceStateToString(BaseRtcmSourceState state)
{
    switch (state) {
    case BaseRtcmSourceState::LocalActive: return "LOCAL_ACTIVE";
    case BaseRtcmSourceState::TempPreparing: return "TEMP_PREPARING";
    case BaseRtcmSourceState::TempResetting: return "TEMP_RESETTING";
    case BaseRtcmSourceState::TempActive: return "TEMP_ACTIVE";
    case BaseRtcmSourceState::LocalFallback: return "LOCAL_FALLBACK";
    default: return "UNKNOWN";
    }
}

size_t baseEspNowCopyLatestRoverEcef(BaseRoverEcefStatus* destination,
                                     size_t capacity)
{
    if (destination == nullptr || capacity == 0) {
        return 0;
    }
    const size_t count = ESPNOW_MAX_ECEF_SOURCES < capacity
                             ? ESPNOW_MAX_ECEF_SOURCES
                             : capacity;
    portENTER_CRITICAL(&ecefMux);
    for (size_t index = 0; index < count; ++index) {
        destination[index] = latestRoverEcef[index];
    }
    portEXIT_CRITICAL(&ecefMux);
    return count;
}

static BaseGnssCommandQueueResult queueRoverGnssCommand(
    uint8_t commandId,
    const uint8_t* requestedTargetMac,
    uint32_t transactionId,
    int64_t ecefXScaled,
    int64_t ecefYScaled,
    int64_t ecefZScaled,
    uint8_t selectedTargetMac[6])
{
    const bool validEcef =
        rtcmEspNowValidEcef(ecefXScaled, ecefYScaled, ecefZScaled);
    const bool validArguments =
        transactionId != 0 &&
        ((commandId == RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_FIXED_ECEF &&
         validEcef) ||
         ((commandId == RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER ||
           commandId == RTCM_ESPNOW_GNSS_COMMAND_RESET_RTK ||
           commandId == RTCM_ESPNOW_GNSS_COMMAND_RESUME_RTK) &&
          ecefXScaled == 0 &&
          ecefYScaled == 0 &&
          ecefZScaled == 0));
    if (!validArguments) {
        return BaseGnssCommandQueueResult::InvalidArgument;
    }
    if (gnssCommandQueue == nullptr) {
        return BaseGnssCommandQueueResult::NotReady;
    }

    QueuedGnssCommand command{};
    bool targetFound = false;
    portENTER_CRITICAL(&peerMux);
    if (requestedTargetMac == nullptr && roverPeerCount > 0) {
        std::memcpy(command.roverMac, roverPeers[0].mac, sizeof(command.roverMac));
        targetFound = true;
    } else if (requestedTargetMac != nullptr) {
        for (size_t index = 0; index < roverPeerCount; ++index) {
            if (macEquals(roverPeers[index].mac, requestedTargetMac)) {
                std::memcpy(command.roverMac,
                            roverPeers[index].mac,
                            sizeof(command.roverMac));
                targetFound = true;
                break;
            }
        }
    }
    portEXIT_CRITICAL(&peerMux);
    if (!targetFound || !macIsConfigured(command.roverMac)) {
        if (requestedTargetMac != nullptr) {
            return BaseGnssCommandQueueResult::TargetNotPaired;
        }
        return BaseGnssCommandQueueResult::NoPairedRover;
    }
    command.transactionId = transactionId;
    command.ecefXScaled = ecefXScaled;
    command.ecefYScaled = ecefYScaled;
    command.ecefZScaled = ecefZScaled;
    command.commandId = commandId;
    if (xQueueSend(gnssCommandQueue, &command, 0) != pdTRUE) {
        return BaseGnssCommandQueueResult::QueueFull;
    }
    if (selectedTargetMac != nullptr) {
        std::memcpy(selectedTargetMac, command.roverMac, 6);
    }
    incrementStat(&BaseEspnowStats::gnssCommandQueued);
    return BaseGnssCommandQueueResult::Queued;
}

