NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
void beginResetCohort()
{
    const uint32_t now = millis();
    BaseRtcmSourceSnapshot source = getBaseRtcmSourceSnapshot();
    if (source.state != BaseRtcmSourceState::TempPreparing) {
        return;
    }

    const size_t snapshotCount =
        baseEspNowCopyLatestRoverEcef(resetCohortSnapshots,
                                     ESPNOW_MAX_ECEF_SOURCES);
    RoverPeer peers[ESPNOW_MAX_PAIRED_ROVERS] = {};
    const size_t peerCount =
        copyRoverPeers(peers, ESPNOW_MAX_PAIRED_ROVERS);

    portENTER_CRITICAL(&resetMux);
    std::memset(resetCohort, 0, sizeof(resetCohort));
    std::memset(resetBranches, 0, sizeof(resetBranches));
    resetCohortCount = 0;
    resetBranchCount = 0;
    resetGateStartedAtMs = now;
    resetWaitingForFreshTempLogged = false;
    for (size_t index = 0; index < snapshotCount; ++index) {
        const BaseRoverEcefStatus& status = resetCohortSnapshots[index];
        if (!status.valid ||
            macEquals(status.mac, source.tempBaseMac) ||
            resetCohortCount >= ESPNOW_MAX_ECEF_SOURCES) {
            continue;
        }

        const uint8_t* branchMac = status.viaRelay
                                       ? status.relayMac
                                       : status.mac;
        if (!macIsConfigured(branchMac)) {
            continue;
        }
        ResetCohortEntry& entry = resetCohort[resetCohortCount++];
        std::memcpy(entry.roverMac, status.mac, sizeof(entry.roverMac));
        std::memcpy(entry.branchMac, branchMac, sizeof(entry.branchMac));
        entry.baselineReceivedAtMs = status.receivedAtMs;

        bool branchExists = false;
        for (size_t branchIndex = 0;
             branchIndex < resetBranchCount;
             ++branchIndex) {
            branchExists =
                macEquals(resetBranches[branchIndex].mac, branchMac);
            if (branchExists) {
                break;
            }
        }
        if (!branchExists && resetBranchCount < ESPNOW_MAX_PAIRED_ROVERS) {
            ResetCohortBranch& branch = resetBranches[resetBranchCount++];
            std::memcpy(branch.mac, branchMac, sizeof(branch.mac));
            do {
                branch.transactionId = esp_random();
            } while (branch.transactionId == 0);
        }
    }

    // A paired Rover remains part of the handover gate even if its last ECEF
    // status is stale or it rebooted immediately before this transition.
    for (size_t peerIndex = 0; peerIndex < peerCount; ++peerIndex) {
        const RoverPeer& peer = peers[peerIndex];
        if (!macIsConfigured(peer.mac) ||
            macEquals(peer.mac, source.tempBaseMac)) {
            continue;
        }

        bool roverExists = false;
        for (size_t cohortIndex = 0;
             cohortIndex < resetCohortCount;
             ++cohortIndex) {
            if (macEquals(resetCohort[cohortIndex].roverMac, peer.mac)) {
                roverExists = true;
                break;
            }
        }
        if (!roverExists &&
            resetCohortCount < ESPNOW_MAX_ECEF_SOURCES) {
            ResetCohortEntry& entry =
                resetCohort[resetCohortCount++];
            std::memcpy(entry.roverMac, peer.mac,
                        sizeof(entry.roverMac));
            std::memcpy(entry.branchMac, peer.mac,
                        sizeof(entry.branchMac));
        }

        bool branchExists = false;
        for (size_t branchIndex = 0;
             branchIndex < resetBranchCount;
             ++branchIndex) {
            if (macEquals(resetBranches[branchIndex].mac, peer.mac)) {
                branchExists = true;
                break;
            }
        }
        if (!branchExists &&
            resetBranchCount < ESPNOW_MAX_PAIRED_ROVERS) {
            ResetCohortBranch& branch =
                resetBranches[resetBranchCount++];
            std::memcpy(branch.mac, peer.mac, sizeof(branch.mac));
            do {
                branch.transactionId = esp_random();
            } while (branch.transactionId == 0);
        }
    }
    portEXIT_CRITICAL(&resetMux);

    portENTER_CRITICAL(&sourceMux);
    if (rtcmSource.state == BaseRtcmSourceState::TempPreparing &&
        macEquals(rtcmSource.tempBaseMac, source.tempBaseMac)) {
        rtcmSource.state = BaseRtcmSourceState::TempResetting;
    }
    const bool resetting =
        rtcmSource.state == BaseRtcmSourceState::TempResetting;
    portEXIT_CRITICAL(&sourceMux);
    if (!resetting) {
        return;
    }

    ResetCohortBranch branches[ESPNOW_MAX_PAIRED_ROVERS] = {};
    size_t branchCount = 0;
    size_t cohortCount = 0;
    portENTER_CRITICAL(&resetMux);
    branchCount = resetBranchCount;
    cohortCount = resetCohortCount;
    std::memcpy(branches, resetBranches,
                branchCount * sizeof(ResetCohortBranch));
    portEXIT_CRITICAL(&resetMux);

    Serial.printf("[BASE][HANDOVER_RESET] state=START rovers=%u branches=%u "
                  "timeout_ms=%lu\n",
                  static_cast<unsigned>(cohortCount),
                  static_cast<unsigned>(branchCount),
                  static_cast<unsigned long>(TEMP_RESET_GATE_TIMEOUT_MS));
    for (size_t index = 0; index < branchCount; ++index) {
        setRoverRtcmEnabled(branches[index].mac, false);
        uint8_t selectedMac[6] = {};
        const BaseGnssCommandQueueResult result = queueRoverGnssCommand(
            RTCM_ESPNOW_GNSS_COMMAND_RESET_RTK,
            branches[index].mac,
            branches[index].transactionId,
            0,
            0,
            0,
            selectedMac);
        portENTER_CRITICAL(&resetMux);
        for (size_t branchIndex = 0;
             branchIndex < resetBranchCount;
             ++branchIndex) {
            if (macEquals(resetBranches[branchIndex].mac,
                          branches[index].mac)) {
                resetBranches[branchIndex].commandQueued =
                    result == BaseGnssCommandQueueResult::Queued;
                break;
            }
        }
        portEXIT_CRITICAL(&resetMux);
        Serial.printf("[BASE][HANDOVER_RESET] branch=%s txn=%lu queue=%s\n",
                      macToString(branches[index].mac).c_str(),
                      static_cast<unsigned long>(
                          branches[index].transactionId),
                      baseGnssCommandQueueResultToString(result));
    }
}

