NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
void observeResetCohortStatus(const uint8_t* roverMac,
                              uint8_t fixQuality,
                              uint32_t receivedAtMs)
{
    if (roverMac == nullptr || fixQuality == 4 || fixQuality == 5) {
        return;
    }
    bool observed = false;
    portENTER_CRITICAL(&resetMux);
    for (size_t index = 0; index < resetCohortCount; ++index) {
        ResetCohortEntry& entry = resetCohort[index];
        if (macEquals(entry.roverMac, roverMac) &&
            receivedAtMs > entry.baselineReceivedAtMs) {
            entry.nonRtkObservedAtMs = receivedAtMs;
            observed = true;
            break;
        }
    }
    portEXIT_CRITICAL(&resetMux);
    if (observed) {
        Serial.printf("[BASE][HANDOVER_RESET] rover=%s fresh_fix=%u\n",
                      macToString(roverMac).c_str(),
                      static_cast<unsigned>(fixQuality));
    }
}

void markResetBranchAcked(const uint8_t* branchMac)
{
    if (branchMac == nullptr) {
        return;
    }
    bool marked = false;
    const uint32_t now = millis();
    portENTER_CRITICAL(&resetMux);
    for (size_t index = 0; index < resetBranchCount; ++index) {
        if (macEquals(resetBranches[index].mac, branchMac)) {
            resetBranches[index].commandAcked = true;
            resetBranches[index].ackedAtMs = now;
            marked = true;
            break;
        }
    }
    portEXIT_CRITICAL(&resetMux);
    if (marked) {
        Serial.printf("[BASE][HANDOVER_RESET] branch=%s command_ack=1\n",
                      macToString(branchMac).c_str());
    }
}

void queueRtkResumeForBranches(const ResetCohortBranch* branches,
                               size_t branchCount,
                               const char* reason)
{
    for (size_t index = 0; index < branchCount; ++index) {
        setRoverRtcmEnabled(branches[index].mac, false);
        uint32_t transactionId = 0;
        do {
            transactionId = esp_random();
        } while (transactionId == 0);
        uint8_t selectedMac[6] = {};
        const BaseGnssCommandQueueResult result = queueRoverGnssCommand(
            RTCM_ESPNOW_GNSS_COMMAND_RESUME_RTK,
            branches[index].mac,
            transactionId,
            0,
            0,
            0,
            selectedMac);
        Serial.printf("[BASE][HANDOVER_RESUME] branch=%s txn=%lu queue=%s reason=%s\n",
                      macToString(branches[index].mac).c_str(),
                      static_cast<unsigned long>(transactionId),
                      baseGnssCommandQueueResultToString(result),
                      reason == nullptr ? "unknown" : reason);
    }
}

void progressResetCohort(uint32_t now)
{
    BaseRtcmSourceSnapshot source = getBaseRtcmSourceSnapshot();
    if (source.state != BaseRtcmSourceState::TempResetting) {
        return;
    }

    bool ready = true;
    bool gateTimedOut = false;
    ResetCohortBranch branches[ESPNOW_MAX_PAIRED_ROVERS] = {};
    size_t branchCount = 0;
    portENTER_CRITICAL(&resetMux);
    branchCount = resetBranchCount;
    std::memcpy(branches, resetBranches,
                branchCount * sizeof(ResetCohortBranch));
    for (size_t index = 0; index < resetBranchCount; ++index) {
        ready = ready && resetBranches[index].commandQueued &&
                resetBranches[index].commandAcked;
    }
    for (size_t index = 0; index < resetCohortCount; ++index) {
        uint32_t branchAckedAtMs = 0;
        for (size_t branchIndex = 0;
             branchIndex < resetBranchCount;
             ++branchIndex) {
            if (macEquals(resetCohort[index].branchMac,
                          resetBranches[branchIndex].mac)) {
                branchAckedAtMs = resetBranches[branchIndex].ackedAtMs;
                break;
            }
        }
        ready = ready &&
                resetCohort[index].nonRtkObservedAtMs >= branchAckedAtMs &&
                branchAckedAtMs != 0;
    }
    gateTimedOut =
        now - resetGateStartedAtMs > TEMP_RESET_GATE_TIMEOUT_MS;
    portEXIT_CRITICAL(&resetMux);

    const bool tempFrameFresh =
        source.lastTempFrameAtMs != 0 &&
        now - source.lastTempFrameAtMs <= TEMP_RTCM_SOURCE_TIMEOUT_MS;

    // The reset ACK/fix gate and temp RTCM freshness can become ready on
    // different loop iterations. Do not activate a source whose last frame
    // is already stale: that would make the next baseEspNowLoop() iteration
    // immediately fall back to the local Base. Keep the cohort reset and wait
    // for a fresh temp frame, bounded by the overall reset-gate timeout.
    if (!gateTimedOut && (!ready || !tempFrameFresh)) {
        if (ready && !tempFrameFresh && !resetWaitingForFreshTempLogged) {
            resetWaitingForFreshTempLogged = true;
            const uint32_t tempAgeMs =
                source.lastTempFrameAtMs == 0
                    ? UINT32_MAX
                    : now - source.lastTempFrameAtMs;
            Serial.printf("[BASE][HANDOVER_RESET] state=WAIT_TEMP_FRESH "
                          "temp_age_ms=%lu timeout_ms=%lu\n",
                          static_cast<unsigned long>(tempAgeMs),
                          static_cast<unsigned long>(
                              TEMP_RESET_GATE_TIMEOUT_MS -
                              (now - resetGateStartedAtMs)));
        }
        return;
    }
    if (!gateTimedOut && ready && tempFrameFresh) {
        if (tempRtcmFrameQueue != nullptr) {
            xQueueReset(tempRtcmFrameQueue);
        }
        Serial.println("[BASE][HANDOVER_RESET] state=COMPLETE");
        queueRtkResumeForBranches(branches, branchCount, "temp_active");
        activateTempSource();
    } else {
        Serial.println("[BASE][HANDOVER_RESET][ERROR] state=TIMEOUT; keep local RTCM");
        queueRtkResumeForBranches(branches, branchCount, "local_fallback");
        switchToLocalFallback("reset_gate_timeout");
        uint8_t ignoredMac[6] = {};
        uint32_t transactionId = 0;
        do {
            transactionId = esp_random();
        } while (transactionId == 0);
        const BaseGnssCommandQueueResult result = queueRoverGnssCommand(
            RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER,
            source.tempBaseMac,
            transactionId,
            0,
            0,
            0,
            ignoredMac);
        Serial.printf("[BASE][HANDOVER_RESET] rollback_temp=%s queue=%s\n",
                      macToString(source.tempBaseMac).c_str(),
                      baseGnssCommandQueueResultToString(result));
    }

    portENTER_CRITICAL(&resetMux);
    std::memset(resetCohort, 0, sizeof(resetCohort));
    std::memset(resetBranches, 0, sizeof(resetBranches));
    resetCohortCount = 0;
    resetBranchCount = 0;
    resetGateStartedAtMs = 0;
    resetWaitingForFreshTempLogged = false;
    portEXIT_CRITICAL(&resetMux);
}

