NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
BaseGnssCommandQueueResult baseEspNowQueueFirstRoverMode(
    uint32_t transactionId,
    uint8_t targetMac[6])
{
    return queueRoverGnssCommand(
        RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER,
        nullptr,
        transactionId,
        0,
        0,
        0,
        targetMac);
}

void baseEspNowMarkLocalBaseReady()
{
    portENTER_CRITICAL(&sourceMux);
    if (rtcmSource.state == BaseRtcmSourceState::LocalFallback) {
        rtcmSource.state = BaseRtcmSourceState::LocalActive;
        std::memset(rtcmSource.tempBaseMac, 0,
                    sizeof(rtcmSource.tempBaseMac));
    }
    portEXIT_CRITICAL(&sourceMux);
}

BaseGnssCommandQueueResult baseEspNowQueueRoverMode(
    const uint8_t requestedTargetMac[6],
    uint32_t transactionId,
    uint8_t selectedTargetMac[6])
{
    return queueRoverGnssCommand(
        RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_ROVER,
        requestedTargetMac,
        transactionId,
        0,
        0,
        0,
        selectedTargetMac);
}

BaseGnssCommandQueueResult baseEspNowQueueRoverBaseFixedEcef(
    const uint8_t requestedTargetMac[6],
    uint32_t transactionId,
    int64_t ecefXScaled,
    int64_t ecefYScaled,
    int64_t ecefZScaled,
    uint8_t selectedTargetMac[6])
{
    return queueRoverGnssCommand(
        RTCM_ESPNOW_GNSS_COMMAND_SWITCH_TO_BASE_FIXED_ECEF,
        requestedTargetMac,
        transactionId,
        ecefXScaled,
        ecefYScaled,
        ecefZScaled,
        selectedTargetMac);
}

BaseGnssCommandQueueResult baseEspNowQueueRoverRtkReset(
    const uint8_t requestedTargetMac[6],
    uint32_t transactionId,
    uint8_t selectedTargetMac[6])
{
    return queueRoverGnssCommand(
        RTCM_ESPNOW_GNSS_COMMAND_RESET_RTK,
        requestedTargetMac,
        transactionId,
        0,
        0,
        0,
        selectedTargetMac);
}

bool baseEspNowIsDirectRoverPaired(const uint8_t targetMac[6])
{
    size_t ignoredIndex = 0;
    return targetMac != nullptr && findRoverPeerIndex(targetMac, ignoredIndex);
}

bool baseEspNowPopGnssCommandResult(BaseGnssCommandResultEvent& result)
{
    return gnssCommandResultQueue != nullptr &&
           xQueueReceive(gnssCommandResultQueue, &result, 0) == pdTRUE;
}

const char* baseGnssCommandQueueResultToString(BaseGnssCommandQueueResult result)
{
    switch (result) {
    case BaseGnssCommandQueueResult::Queued: return "queued";
    case BaseGnssCommandQueueResult::InvalidArgument: return "invalid_argument";
    case BaseGnssCommandQueueResult::NotReady: return "not_ready";
    case BaseGnssCommandQueueResult::NoPairedRover: return "no_paired_rover";
    case BaseGnssCommandQueueResult::TargetNotPaired: return "target_not_paired";
    case BaseGnssCommandQueueResult::QueueFull: return "queue_full";
    default: return "unknown";
    }
}
